while True:
    m = input("Введите месяц в виде целого числа от 1 до 12: ")
    if m.isdecimal():
        m = int(m)
        if 0 < m <= 12:
            break
    print("Ошибка ввода")

l_s = [["зиме", 12, 1, 2], ["весне", 3, 4, 5], ["лету", 6, 7, 8], ["осени", 9, 10, 11]]
for i in l_s:
    if m in i:
        print(f"Введенный месяц относится к {i[0]}")
        break

l_s2 = ["зиме", "зиме", "весне", "весне", "весне", "лету", "лету", "лету", "осени", "осени", "осени", "зиме"]
print(f"Введенный месяц относится к {l_s2[m - 1]}")

d_s = {"зиме": [12, 1, 2], "весне": [3, 4, 5], "лету": [6, 7, 8], "осени": [9, 10, 11]}
for key in d_s:
    if m in d_s[key]:
        print(f"Введенный месяц относится к {key}")
        break

d_s2 = {12: "зиме", 1: "зиме", 2: "зиме", 3: "весне",
        4: "весне", 5: "весне", 6: "лету", 7: "лету",
        8: "лету", 9: "осени", 10: "осени", 11: "осени"}
print(f"Введенный месяц относится к {d_s2[m]}")

# В качестве бреда :) :
d_s_s = {'12': "зиме", '1': "зиме", '2': "зиме", '3': "весне",
         '4': "весне", '5': "весне", '6': "лету", '7': "лету",
         '8': "лету", '9': "осени", '10': "осени", '11': "осени"}
while True:
    m = input("Введите месяц в виде целого числа от 1 до 12: ")
    if m in d_s_s:
        print(f"Введенный месяц относится к {d_s_s[m]}")
        break
    print("Ошибка ввода")
